Revit 2024 API
TextNode Methods
The TextNode type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RenderNode.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFormattedText
 Returns an FormattedText object that contains text and associated formatting of this TextNode.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
TextNode Class
Autodesk.Revit.DB Namespace